; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v3 ?v7)
             (pred_4 ?v8 ?v10)
             (pred_8 ?v3 ?v10)
             (pred_9 ?v6 ?v3 )
	     (pred_5 ?v3)
             (pred_11 ?v11)
             (pred_6 ?v8)
             (pred_1 ?v10)
             (pred_12 ?v3)
             (pred_2 ?v8)
             (pred_3 ?v3)
             (pred_7 ))



(:action op_4
:parameters (?v4 ?v5 ?v13 ?v1)
:precondition (and (pred_11 ?v4) (pred_11 ?v5) (pred_6 ?v13) (pred_1 ?v1)
          (pred_10 ?v4 ?v5) (pred_4 ?v13 ?v1)
                   (pred_8 ?v5 ?v1) (pred_5 ?v4) 
                   (pred_12 ?v5) (pred_2 ?v13))
:effect (and  (pred_3 ?v5) (not (pred_12 ?v5))))


(:action op_5
:parameters (?v4 ?v12)
:precondition (and (pred_11 ?v4) (pred_11 ?v12)
               (pred_5 ?v4) (pred_10 ?v4 ?v12) (pred_3 ?v12))
:effect (and (pred_5 ?v12) (not (pred_5 ?v4))))

(:action op_2
:parameters (?v4 ?v13)
:precondition (and (pred_11 ?v4) (pred_6 ?v13) 
                  (pred_5 ?v4) (pred_9 ?v13 ?v4) (pred_7 ))
:effect (and (pred_2 ?v13)
   (not (pred_9 ?v13 ?v4)) (not (pred_7 ))))


(:action op_1
:parameters (?v4 ?v2 ?v9)
:precondition (and (pred_11 ?v4) (pred_6 ?v2) (pred_6 ?v9)
                  (pred_5 ?v4) (pred_2 ?v9) (pred_9 ?v2 ?v4))
:effect (and (pred_2 ?v2) (pred_9 ?v9 ?v4)
        (not (pred_2 ?v9)) (not (pred_9 ?v2 ?v4))))

(:action op_3
:parameters (?v4 ?v13)
:precondition (and (pred_11 ?v4) (pred_6 ?v13) 
                  (pred_5 ?v4) (pred_2 ?v13))
:effect (and (pred_7 ) (pred_9 ?v13 ?v4) (not (pred_2 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_30 obj_24 obj_10 obj_20 obj_32 obj_31 obj_01 obj_09 obj_05 obj_02 obj_11 obj_21 obj_26 obj_22 obj_28 obj_27 obj_17 obj_15 obj_03 obj_19 obj_08 obj_14 obj_23 obj_29 obj_13
    obj_18 obj_04 obj_06
    obj_07 obj_12 obj_25 obj_16
    )

    (:init
       (pred_7)

       (pred_11 obj_30)
       (pred_11 obj_24)
       (pred_11 obj_10)
       (pred_11 obj_20)
       (pred_11 obj_32)
       (pred_11 obj_31)
       (pred_11 obj_01)
       (pred_11 obj_09)
       (pred_11 obj_05)
       (pred_11 obj_02)
       (pred_11 obj_11)
       (pred_11 obj_21)
       (pred_11 obj_26)
       (pred_11 obj_22)
       (pred_11 obj_28)
       (pred_11 obj_27)
       (pred_11 obj_17)
       (pred_11 obj_15)
       (pred_11 obj_03)
       (pred_11 obj_19)
       (pred_11 obj_08)
       (pred_11 obj_14)
       (pred_11 obj_23)
       (pred_11 obj_29)
       (pred_11 obj_13)
       (pred_1 obj_18)
       (pred_1 obj_04)
       (pred_1 obj_06)
       (pred_6 obj_07)
       (pred_6 obj_12)
       (pred_6 obj_25)
       (pred_6 obj_16)

       (pred_10 obj_30 obj_31)
       (pred_10 obj_30 obj_24)
       (pred_10 obj_24 obj_01)
       (pred_10 obj_24 obj_10)
       (pred_10 obj_24 obj_30)
       (pred_10 obj_10 obj_09)
       (pred_10 obj_10 obj_20)
       (pred_10 obj_10 obj_24)
       (pred_10 obj_20 obj_05)
       (pred_10 obj_20 obj_32)
       (pred_10 obj_20 obj_10)
       (pred_10 obj_32 obj_02)
       (pred_10 obj_32 obj_20)
       (pred_10 obj_31 obj_11)
       (pred_10 obj_31 obj_01)
       (pred_10 obj_31 obj_30)
       (pred_10 obj_01 obj_21)
       (pred_10 obj_01 obj_09)
       (pred_10 obj_01 obj_24)
       (pred_10 obj_01 obj_31)
       (pred_10 obj_09 obj_26)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_09 obj_10)
       (pred_10 obj_09 obj_01)
       (pred_10 obj_05 obj_22)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_05 obj_20)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_02 obj_28)
       (pred_10 obj_02 obj_32)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_11 obj_27)
       (pred_10 obj_11 obj_21)
       (pred_10 obj_11 obj_31)
       (pred_10 obj_21 obj_17)
       (pred_10 obj_21 obj_26)
       (pred_10 obj_21 obj_01)
       (pred_10 obj_21 obj_11)
       (pred_10 obj_26 obj_15)
       (pred_10 obj_26 obj_22)
       (pred_10 obj_26 obj_09)
       (pred_10 obj_26 obj_21)
       (pred_10 obj_22 obj_03)
       (pred_10 obj_22 obj_28)
       (pred_10 obj_22 obj_05)
       (pred_10 obj_22 obj_26)
       (pred_10 obj_28 obj_19)
       (pred_10 obj_28 obj_02)
       (pred_10 obj_28 obj_22)
       (pred_10 obj_27 obj_08)
       (pred_10 obj_27 obj_17)
       (pred_10 obj_27 obj_11)
       (pred_10 obj_17 obj_14)
       (pred_10 obj_17 obj_15)
       (pred_10 obj_17 obj_21)
       (pred_10 obj_17 obj_27)
       (pred_10 obj_15 obj_23)
       (pred_10 obj_15 obj_03)
       (pred_10 obj_15 obj_26)
       (pred_10 obj_15 obj_17)
       (pred_10 obj_03 obj_29)
       (pred_10 obj_03 obj_19)
       (pred_10 obj_03 obj_22)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_19 obj_13)
       (pred_10 obj_19 obj_28)
       (pred_10 obj_19 obj_03)
       (pred_10 obj_08 obj_14)
       (pred_10 obj_08 obj_27)
       (pred_10 obj_14 obj_23)
       (pred_10 obj_14 obj_17)
       (pred_10 obj_14 obj_08)
       (pred_10 obj_23 obj_29)
       (pred_10 obj_23 obj_15)
       (pred_10 obj_23 obj_14)
       (pred_10 obj_29 obj_13)
       (pred_10 obj_29 obj_03)
       (pred_10 obj_29 obj_23)
       (pred_10 obj_13 obj_19)
       (pred_10 obj_13 obj_29)
       (pred_12 obj_14)
       (pred_12 obj_01)
       (pred_12 obj_11)
       (pred_12 obj_02)
       (pred_8  obj_14 obj_18)
       (pred_8  obj_01 obj_04)
       (pred_8  obj_11 obj_06)
       (pred_8  obj_02 obj_06)
       (pred_3 obj_30)
       (pred_3 obj_24)
       (pred_3 obj_10)
       (pred_3 obj_20)
       (pred_3 obj_32)
       (pred_3 obj_31)
       (pred_3 obj_09)
       (pred_3 obj_05)
       (pred_3 obj_21)
       (pred_3 obj_26)
       (pred_3 obj_22)
       (pred_3 obj_28)
       (pred_3 obj_27)
       (pred_3 obj_17)
       (pred_3 obj_15)
       (pred_3 obj_03)
       (pred_3 obj_19)
       (pred_3 obj_08)
       (pred_3 obj_23)
       (pred_3 obj_29)
       (pred_3 obj_13)

       (pred_4  obj_07 obj_18)
       (pred_4  obj_12 obj_04)
       (pred_4  obj_25 obj_06)
       (pred_4  obj_16 obj_18)
       (pred_9 obj_07 obj_09)
       (pred_9 obj_12 obj_32)
       (pred_9 obj_25 obj_30)
       (pred_9 obj_16 obj_13)
       (pred_5 obj_17)
    )

    (:goal (and
       (pred_9 obj_07 obj_15)
       (pred_9 obj_25 obj_02)
    ))
(:constraints
  (always (not (pred_5 obj_26)))
)
)

; plan
1. (op_5 obj_17 obj_15)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_15)
   goals met: 0 of 2
2. (op_5 obj_15 obj_03)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_03)
   goals met: 0 of 2
3. (op_5 obj_03 obj_22)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_22)
   goals met: 0 of 2
4. (op_5 obj_22 obj_05)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_05)
   goals met: 0 of 2
5. (op_5 obj_05 obj_09)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_09)
   goals met: 0 of 2
6. (op_5 obj_09 obj_10)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_10)
   goals met: 0 of 2
7. (op_5 obj_10 obj_24)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_24)
   goals met: 0 of 2
8. (op_5 obj_24 obj_30)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_30)
   goals met: 0 of 2
9. (op_2 obj_30 obj_25)
   deleted: (pred_9 obj_25 obj_30) (pred_7)
   added: (pred_2 obj_25)
   goals met: 0 of 2
10. (op_5 obj_30 obj_24)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_24)
   goals met: 0 of 2
11. (op_5 obj_24 obj_10)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_10)
   goals met: 0 of 2
12. (op_5 obj_10 obj_09)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_09)
   goals met: 0 of 2
13. (op_5 obj_09 obj_05)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_05)
   goals met: 0 of 2
14. (op_4 obj_05 obj_02 obj_25 obj_06)
   deleted: (pred_12 obj_02)
   added: (pred_3 obj_02)
   goals met: 0 of 2
15. (op_5 obj_05 obj_02)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_02)
   goals met: 0 of 2
16. (op_3 obj_02 obj_25)
   deleted: (pred_2 obj_25)
   added: (pred_7) (pred_9 obj_25 obj_02)
   goals met: 1 of 2
17. (op_5 obj_02 obj_05)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_05)
   goals met: 1 of 2
18. (op_5 obj_05 obj_09)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_09)
   goals met: 1 of 2
19. (op_2 obj_09 obj_07)
   deleted: (pred_9 obj_07 obj_09) (pred_7)
   added: (pred_2 obj_07)
   goals met: 1 of 2
20. (op_5 obj_09 obj_05)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_05)
   goals met: 1 of 2
21. (op_5 obj_05 obj_22)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_22)
   goals met: 1 of 2
22. (op_5 obj_22 obj_03)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_03)
   goals met: 1 of 2
23. (op_5 obj_03 obj_15)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_15)
   goals met: 1 of 2
24. (op_3 obj_15 obj_07)
   deleted: (pred_2 obj_07)
   added: (pred_7) (pred_9 obj_07 obj_15)
   goals met: 2 of 2
